{
  "name": "252d0a36-9d7d-44d7-b963-7b3f3a21210e",
  "displayName": "buildship",
  "description": "Mapping Entities to Marketplace Fields\n\nMap the extracted entities from the agent response to the corresponding fields in the respective marketplace listings. Use the following guidelines:\n\n\nMarketplace:\n\nAmazon: Map \"Product Type\" to \"Product Title\" and \"Product Category.\"\neBay: Map \"Product Type\" to \"Item Title\" and \"Item Category.\"\nEtsy, Shopify, Walmart, Facebook Marketplace, Mercari, Poshmark: Map \"Product Type\" to the appropriate \"Category\" field.\nAlibaba: Map \"Product Type\" to \"Category.\"\nCondition: Include the condition of the item. This field is optional for Amazon and eBay but may be relevant for other marketplaces.\n\nBrand: Map the brand of the product. This field is optional for eBay but essential for Amazon and most other marketplaces.\n\nPrice: Ensure you map the price correctly to the respective field for all marketplaces.\n\nQuantity: Map the quantity or inventory amount accurately. This field is labeled \"Quantity\" for most marketplaces, \"Inventory Quantity\" for Shopify, and is optional for Facebook Marketplace.\n\nImage URL: Provide the URL for the main image. This is commonly labeled \"Main Image URL\" across different marketplaces.\n\nAdditional Fields: Depending on the marketplace, you may need to map other entities, such as product description, SKU, shipping information, or specific attributes like color, size, or material. Refer to each marketplace's listing requirements.\n\n\nYour task is to create a mapping logic that takes the agent response as input and returns the structured listing data, ensuring that the entities are correctly mapped to the corresponding fields for each marketplace. This prompt ensures that the agent accurately maps the extracted information to the appropriate fields, facilitating seamless and consistent listings across different e-commerce platforms.",
  "openApiSpec": {
    "authentication": {
      "apiKeyConfig": {
        "keyName": "1723250414321",
        "apiKey": "api",
        "requestLocation": "HEADER"
      }
    }
  },
  "toolType": "CUSTOMIZED_TOOL"
}
